{
  "projects": [
    {
      "image": "images/projects/Projet-2.png",
      "title": "Projet Booki",
      "bodyText": "- Ce site a été méticuleusement conçu en respectant la maquette initiale du projet 'Booki', dédié à la réservation d'hébergements à Marseille.\n - Doté d'une interface adaptative, le site offre une expérience utilisateur optimale sur tous types d'appareils.\n",
      "links": [
        {
          "text": "GitHub",
          "href": "https://github.com/KaiserCrow/Projet_2_Ton_Steven.git"
        },
        {
          "text": "Live",
          "href": "https://kaisercrow.github.io/Projet_2_Ton_Steven/"
        }
      ],
      "tags": ["HTML", "CSS"]
    },
    {
      "image": "images/projects/Projet-5.png",
      "title": " Projet de débogage du site de Nina Carducci ",
      "bodyText": "- Dans le contexte d'un projet de formation avec OpenClassrooms, j'ai été mis en situation en tant que développeur front-end pour aider a débugger un site web d'une photographe. Le projet simulé consistait à travailler sur le portfolio numérique de la photographe Nina Carducci. Ce scénario pédagogique m'a offert l'opportunité de mettre en pratique diverses compétences en développement front-end.   \n - Optimisation des performances du site web permettant un chargement plus rapide de la page. \n - Réglages des bugs révélés lors de la navigation sur le site. \n - Rédaction d'un rapport complet sur les révisions du site. ",
      "links": [
        {
          "text": "GitHub",
          "href": "https://github.com/KaiserCrow/Projet-5-OC-Ton-Steven.git"
        },
        {
          "text": "Live",
          "href": "https://kaisercrow.github.io/Projet-5-OC-Ton-Steven/"
        }
      ],
      "tags": ["HTML", "CSS", "Javascript"]
    },
    {
      "image": "images/projects/Projet-6.png",
      "title": "Projet Kasa",
      "bodyText": " - Dans le cadre d'un projet de formation avec OpenClassrooms, j'ai été mis en situation comme développeur front-end freelance pour Kasa, un leader fictif de la location d'appartements entre particuliers en France. Mon rôle simulé a consisté à contribuer à une refonte majeure de leur plateforme, passant d'un code legacy en ASP.NET à une stack moderne en JavaScript, NodeJS et React.\n - Mise en place d'une navigation fluide entre les diverses pages de l'application grâce à React Router. \n - Initialisation de l'application à l'aide du framework Create React App pour un démarrage rapide et efficace. \n - Conception d'éléments d'interface utilisateur interactifs en utilisant des composants React modulaires.",
      "links": [
        {
          "text": "GitHub",
          "href": "https://github.com/KaiserCrow/Projet-6-OC-Ton-Steven.git"
        },
        {
          "text": "Live",
          "href": "https://projet-kasa-steven-ton.netlify.app/"
        }
      ],
      "tags": ["HTML", "CSS", "Javascript", "React"]
    }
  ]
}
